id: 152b13bd-18f2-4f7a-9566-e77d9680dfb7
name: CIS 5.2.9 Ensure that Activity Log Alert exists for Create or Update or Delete SQL Server Firewall Rule
description: |
  'Create an activity log alert for the Create or Update or Delete SQL Server Firewall Rule 
event.
  Monitoring for Create or Update or Delete SQL Server Firewall Rule events gives insight 
into network access changes and may reduce the time it takes to detect suspicious activity.
  For more information - https://www.cisecurity.org/benchmark/azure'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: gt
triggerThreshold: 0
query: |
  AzureActivity
  | where TimeGenerated > ago(5m)
  | where CategoryValue =~ "Administrative"
  | where OperationNameValue =~ ""Microsoft.Sql/servers/firewallRules/write"
  | project TimeGenerated, Caller, CallerIpAddress, _ResourceId, ResourceGroup, SubscriptionId
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Caller
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
  - entityType: Azure resource
    fieldMappings:
      - identifier: ResourceId
        columnName: _ResourceId
version: 1.0.0
kind: Scheduled