id: bb2f34a3-39de-4cd9-9e56-31b8aafaacda
name: CIS 5.2.1 Ensure that Activity Log Alert exists for Create Policy Assignment
description: |
  Create an activity log alert for the Create Policy Assignment event.
  Monitoring for create policy assignment events gives insight into changes done in "azure policy - assignments" and can reduce the time it takes to detect unsolicited changes.
  For more information - https://www.cisecurity.org/benchmark/azure
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: gt
triggerThreshold: 0
tags:
  - AzureCISBenchmark
query: |
  AzureActivity
  | where TimeGenerated > ago(5m)
  | where CategoryValue =~ "Administrative"
  | where OperationNameValue =~ "microsoft.authorization/policyassignments/write"
  | project TimeGenerated, Caller, CallerIpAddress, _ResourceId, ResourceGroup, SubscriptionId
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Caller
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
  - entityType: Azure resource
    fieldMappings:
      - identifier: ResourceId
        columnName: _ResourceId
version: 1.0.0
kind: Scheduled