id: f44c23b1-3cfb-4c3a-be96-652bd87d3e2d
name: CIS 5.2.6 Ensure that activity log alert exists for the Delete Network Security Group Rule
description: |
  'Create an activity log alert for the Delete Network Security Group Rule event.
  Monitoring for Delete Network Security Group Rule events gives insight into network access changes and may reduce the time it takes to detect suspicious activity.
  For more information - https://www.cisecurity.org/benchmark/azure'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: gt
triggerThreshold: 0
query: |

  AzureActivity
  | where TimeGenerated > ago(5m)
  | where CategoryValue =~ "Administrative"
  | where OperationNameValue =~ "Microsoft.Network/networkSecurityGroups/securityRules/delete"
  | project TimeGenerated, Caller, CallerIpAddress, _ResourceId, ResourceGroup, SubscriptionId
  | extend AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress, AzCustomEntity = _ResourceId
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
  - entityType: AzureResource
    fieldMappings:
      - identifier: ResourceId
        columnName: AzCustomEntity
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    lookbackDuration: PT1H
    matchingMethod: Selected
    groupByEntities:
      - Account
    groupByAlertDetails:
      - Name
version: 1.0.0
kind: Scheduled